In [3]:
import sqlite3
import pandas as pd

In [4]:
dir_db= "sql-murder-mystery.db"
conn = sqlite3.connect(dir_db)

In [5]:
cursor= conn.cursor()

In [6]:
query = """
SELECT description
FROM crime_scene_report
WHERE date= "20180115" and type = "murder" and city = "SQL City"
"""

cursor= conn.cursor()
mi_query= cursor.execute(query)
mi_query.fetchall()

[('Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".',)]

In [7]:
query1 = """
SELECT *
FROM person
WHERE address_street_name = "Northwestern Dr" and name = "Morty Schapiro"
ORDER BY address_number DESC
LIMIT 1
"""
pd.read_sql_query(query1, conn)

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

In [8]:
query2 = """
SELECT *
FROM person
WHERE address_street_name = "Franklin Ave" and name = "Annabel Miller"
"""
pd.read_sql_query(query2, conn)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

In [9]:
query3 = """
SELECT *
FROM person p 
JOIN interview it ON it.person_Id = p.id
WHERE address_street_name = "Franklin Ave" and name = "Annabel Miller"

"""
pd.read_sql_query(query3, conn)

,id,name,license_id,address_number,address_street_name,ssn,person_id,transcript
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143,16371,"I saw the murder happen, and I recognized the ..."

In [10]:
pd.read_sql_query(query3, conn).iloc[0,7]

'I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.'

In [11]:
 print('Description:\n', mi_query.fetchall()[0][2])

IndexError: list index out of range

In [12]:
query4 = """
SELECT *
FROM person p 
JOIN interview it ON it.person_Id = p.id
WHERE address_street_name= "Northwestern Dr" and name= "Morty Schapiro"
"""
pd.read_sql_query(query4, conn).iloc[0,7]

'I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".'

In [30]:
query5 = """
SELECT *
FROM person p
JOIN drivers_license dl ON p.id = dl.id
"""
pd.read_sql_query(query5, conn)

Empty DataFrame
Columns: [id, name, license_id, address_number, address_street_name, ssn, id, age, height, eye_color, hair_color, gender, plate_number, car_make, car_model]
Index: []

In [75]:
query5 = """
SELECT *
FROM drivers_license dl
WHERE plate_number LIKE "%H42W%"

"""
pd.read_sql_query(query5, conn)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,183779,21,65,blue,blonde,female,H42W0X,Toyota,Prius
1,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS
2,664760,21,71,black,black,male,4H42WR,Nissan,Altima

In [76]:
#Primer sospechoso
query6 = """
SELECT *
FROM person p
JOIN drivers_license dl ON p.license_id = dl.id
WHERE plate_number LIKE "%H42W%"
"""
pd.read_sql_query(query6, conn)

,id,name,license_id,address_number,address_street_name,ssn,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,51739,Tushar Chandra,664760,312,Phi St,137882671,664760,21,71,black,black,male,4H42WR,Nissan,Altima
1,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS
2,78193,Maxine Whitely,183779,110,Fisk Rd,137882671,183779,21,65,blue,blonde,female,H42W0X,Toyota,Prius

In [57]:
query7 = """
SELECT *
FROM get_fit_now_member gt

"""
pd.read_sql_query(query7, conn)

,id,person_id,name,membership_start_date,membership_status
0,NL318,65076,Everette Koepke,20170926,gold
1,AOE21,39426,Noe Locascio,20171005,regular
2,2PN28,63823,Jeromy Heitschmidt,20180215,silver
3,0YJ24,80651,Waneta Wellard,20171206,gold
4,3A08L,32858,Mei Bianchin,20170401,silver
...,...,...,...,...,...
179,2V137,41693,Wendell Dulany,20171219,silver
180,4KB72,79110,Emile Hege,20170522,regular
181,48Z7A,28819,Joe Germuska,20160305,gold
182,48Z55,67318,Jeremy Bowers,20160101,gold
183,90081,16371,Annabel Miller,20160208,gold

In [61]:
query8 = """
SELECT *
FROM get_fit_now_check_in gc
JOIN get_fit_now_member gt ON gc.membership_id = gt.id
WHERE check_in_date LIKE "20180109" and membership_status LIKE "gold" and membership_id LIKE "48Z%"
"""
pd.read_sql_query(query8, conn)

,membership_id,check_in_date,check_in_time,check_out_time,id,person_id,name,membership_start_date,membership_status
0,48Z7A,20180109,1600,1730,48Z7A,28819,Joe Germuska,20160305,gold
1,48Z55,20180109,1530,1700,48Z55,67318,Jeremy Bowers,20160101,gold

In [69]:
query9= """
SELECT *
FROM person p
JOIN drivers_license dl ON p.license_id = dl.id
WHERE name LIKE "Jeremy Bowers"

"""
pd.read_sql_query(query9, conn)

,id,name,license_id,address_number,address_street_name,ssn,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS

In [13]:
conn.close()

In [ ]:
#Subir un excel a la base de datos mirar notebook
df_excel= pd.read_excel("dataset_pruebaTecnica___.xlsx", sheet_name= 1) # probar para subirlo todo (ie, sheet_name=0)
df_excel.to_sql()